# OnText Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExportContextBase..::..OnText Method
IExportContextBase Interface See Also
---
This method is called when a text annotation object is being output.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
void OnText(
	TextNode node
)
```

Visual Basic
---
```text
Sub OnText ( _
	node As TextNode _
)
```

Visual C++
---
```text
void OnText(
	TextNode^ node
)
```

# ### Parameters
node
    Type: Autodesk.Revit.DB..::..TextNode An output node that represents a text annotation.
# See Also
IExportContextBase Interface
Autodesk.Revit.DB Namespace